/***************************************************
*		版权声明
*
*	本操作系统名为：MINE
*	该操作系统未经授权不得以盈利或非盈利为目的进行开发，
*	只允许个人学习以及公开交流使用
*
*	代码最终所有权及解释权归田宇所有；
*
*	本模块作者：	田宇
*	EMail:		345538255@qq.com
*   本模块二次开发：王赛宇
*   EMail:      wangsaiyu@cqu.edu.cn
*
*
***************************************************/

#ifndef _64BITOS_SRC_KERNEL_FONT_H
#define _64BITOS_SRC_KERNEL_FONT_H

/* =========================================================================
 =                                数据声明                                   =
 =========================================================================*/

/**
 * <h3>定义的字符位图，font_ascii[i]代表ascii为i的字符的位图</h3>
 *  <p>- 每一个位图代表一个16行×8列的矩形区域</p>
 *  <p>- 其中：每个char代表一行，char中的每一位代表一个像素点</p>
 */
extern unsigned char font_ascii[256][16];

#endif

